#define 喵 int
#define 喵喵 printf
#define 喵喵喵 (
#define 喵喵喵喵 const
#define 喵喵喵喵喵 char
#define 喵喵喵喵喵喵 *
#define 喵喵喵喵喵喵喵 ,
#define 喵喵喵喵喵喵喵喵 ...
#define 喵喵喵喵喵喵喵喵喵 )
#define 喵喵喵喵喵喵喵喵喵喵 ;
#define 喵喵喵喵喵喵喵喵喵喵喵 main
#define 喵喵喵喵喵喵喵喵喵喵喵喵 {
#define 喵喵喵喵喵喵喵喵喵喵喵喵喵 "Hello, World!\n"
#define 喵喵喵喵喵喵喵喵喵喵喵喵喵喵 return
#define 喵喵喵喵喵喵喵喵喵喵喵喵喵喵喵 0
#define 喵喵喵喵喵喵喵喵喵喵喵喵喵喵喵喵 }

喵 喵喵 喵喵喵 喵喵喵喵 喵喵喵喵喵 喵喵喵喵喵喵 喵喵喵喵喵喵喵 喵喵喵喵喵喵喵喵 喵喵喵喵喵喵喵喵喵 喵喵喵喵喵喵喵喵喵喵

喵 喵喵喵喵喵喵喵喵喵喵喵 喵喵喵 喵喵喵喵喵喵喵喵喵
喵喵喵喵喵喵喵喵喵喵喵喵
    喵喵 喵喵喵 喵喵喵喵喵喵喵喵喵喵喵喵喵 喵喵喵喵喵喵喵喵喵 喵喵喵喵喵喵喵喵喵喵
    喵喵喵喵喵喵喵喵喵喵喵喵喵喵 喵喵喵喵喵喵喵喵喵喵喵喵喵喵喵 喵喵喵喵喵喵喵喵喵喵
喵喵喵喵喵喵喵喵喵喵喵喵喵喵喵喵